app/Controllers/UtilisateurController.php

    public function connexion() {

        $numero = trim($this->request->getPost('numero'));
        if(empty($numero)) {
            return redirect()->back()->with('error', 'Veuillez entrer votre numéro de téléphone.');
        }

        if(!preg_match('/^[0-9]{10}$/', $numero)) {
            return redirect()->back()->with('error', 'Numéro de téléphone invalide. Veuillez entrer un numéro valide.');
        }

        $prefixe = substr($numero, 0, 3);
        $prefixeExiste = $this->prefixeModel
        ->where('valeur', $prefixe)
        ->first();
---
SELECT *
FROM `prefixe`
WHERE `valeur` = '033'
 LIMIT 1

    public function depot() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        if ($this->request->getMethod() === 'GET') {
            return view('client/depot');
        }
        $montant = (float)$this->request->getPost('montant');
        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Montant invalide.');
        }

        $idUtilisateur = session()->get('id_utilisateur');
        $soldeActuel = $this->soldeModel->getSolde($idUtilisateur);
        if (!$soldeActuel) {
            return redirect()->back()->with('error', 'Solde non trouvé.');
        }
        $nouveauMontant = $soldeActuel['montant_dispo'] + $montant;
        $this->soldeModel->updateSolde($idUtilisateur, $nouveauMontant);

        $typeOperation = $this->typeOperationModel->where('nom', 'depot')->first();
---
SELECT *
FROM `type_operation`
WHERE `nom` = 'depot'
 LIMIT 1