app/Models/SoldeModel.php

    public function getSolde($idUtilisateur)
{
    return $this->where('id_utilisateur', $idUtilisateur)->first();
---
SELECT *
FROM `solde`
WHERE `id_utilisateur` = 2
 LIMIT 1

    public function updateSolde($idUtilisateur, $nouveauMontant) {
    $solde = $this->getSolde($idUtilisateur);
    if ($solde) {
        $this->update($solde['id'], [
            'montant_dispo' => $nouveauMontant,
            'date_maj' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `solde` SET `montant_dispo` = 253000, `date_maj` = '2026-07-20 09:54:19'
WHERE `solde`.`id` IN (1)