app/Models/UtilisateurModel.php

    public function getByNumero($numero)
    {
        return $this->where('num_tel', $numero)->first();
---
SELECT *
FROM `utilisateur`
WHERE `num_tel` = '0331234567'
 LIMIT 1